import React from  'react';
import './ourteam.css'

const teamList = [
    {
        name: "Харченко В'ячеслав Вікторович",
        skill: '1С: Професіонал. Успішно склав сертифікаційний екзамен на знання особливостей і застосування програми "1С: Бухгалтерія 8" для України." 1С: Бухгалтерія 7.7 для України - практичне застосування типової конфігурації. Пройшов атестацію на фірмі "1С" по програмному продукту 1С: Бухгалтерия 7.7.',
        photo: 'images/staff-photo.jpg'
    },
    {
        name: "Федорченко Костянтин Олександрович",
        skill: '1С: Професіонал. Успішно склав сертифікаційний екзамен на відповідність рівня кваліфікаційним вимогам, пред\'являємих фірмою "1С", при організації навчального процесу в Центрі Сертифікованого Навчання СумДУ (м.Суми) по курсу Викладач ЦСО. Курс "Введення в конфігурування в системі "1С: Підприємство 8". Основні об\'єкти".',
        photo: 'images/staff-photo.jpg'
    },
    {
        name: "Литвиненко Віталій Михайлович",
        skill: '1С: Професіонал. Успішно склав сертифікаційний екзамен на знання можливостей і особливостей застосування типової конфігурації "Управління торгівлею для України" системи програм "1С: Підприємство 8".""Знання основних механізмів платформи "1С: Підприємство 8.0".Успішно закінчив курс: Microsoft IT Academy Course: Programming in C# National Taras Shevchenko University of Kyiv.',
        photo: 'images/staff-photo.jpg'
    },
    {
        name: "Лиценко Юрій Ігорович",
        skill: '1С: Спеціаліст. Спеціаліст по розробці і модифікації прикладних рішень на технологічній платформі системи програм "1С: Підприємство 8.2".Успішно склав сертифікаційний екзамен на знання можливостей і особливостей застосування типової конфігурації "Управління торгівлею для України" системи програм "1С: Підприємство 8". Успішно склав екзамен по конфігуруванню і впровадженню торгових рішень в прикладних рішеннях "1С: Підприємство 8" для України."',
        photo: 'images/staff-photo.jpg'
    }
];
const ourTeamSetBlock = (
    teamList.map((el, index) =>
        <div className="ourteam-cart" key={index}>
            <img src={el.photo} className="ourteam-cart__photo" alt={el.name}/>
            <div className='ourteam-text'>
                <h3 className="ourteam-text__title">{el.name}</h3>
                <p className="ourteam-text__text">{el.skill}</p>
            </div>
        </div>
    )
);
const OurTeam = () => {
    return(
        <div className="ourteam">
            <div className="container">
                <h2 className="ourteam__title">Наша Команда</h2>
                <p className="ourteam__title-text">Наші фахівці володіють безцінним досвідом та сертифікатами якості в галузі впровадження та обслуговування інформаційних систем автоматизації обліку на базі програмних продуктів «1С: Підприємство».</p>
                <div className="ourteam-wrap">
                    {ourTeamSetBlock}
                </div>
            </div>
        </div>
    )
};
export default OurTeam;